const worktypes = () => [
    { code: '001', name: '出勤', time: '当日8：00～当日17：00', remark: '通常の出勤です。' },
    { code: '002', name: '直行', time: '当日8：00～当日17：00', remark: '直行での出勤です。' },
    { code: '003', name: '出張', time: '当日8：00～当日17：00', remark: '直行直帰をする出勤です。' },
    { code: '004', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '005', name: '出勤', time: '当日8：00～当日17：00', remark: '通常の出勤です。' },
    { code: '006', name: '直行', time: '当日8：00～当日17：00', remark: '直行での出勤です。' },
    { code: '007', name: '出張', time: '当日8：00～当日17：00', remark: '直行直帰をする出勤です。' },
    { code: '008', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '009', name: '直行', time: '当日8：00～当日17：00', remark: '直行での出勤です。' },
    { code: '010', name: '出張', time: '当日8：00～当日17：00', remark: '直行直帰をする出勤です。' },
    { code: '011', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '012', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '013', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '014', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '015', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '016', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '017', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '018', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '019', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '020', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '021', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '022', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '023', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '024', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '025', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' },
    { code: '026', name: '出張（医療）', time: '当日8：00～当日17：00', remark: '病院勤務用の出張です。' }
];


export { worktypes };